"""
Задача 1.1
Создать программу, которая выводит текст:
"Питон - отличный язык программирования!", сказал Алексей. "Не припоминаю когда в последний раз мне было настолько весело."

Итоговый код должен использовать конкатенацию строк.
"""


print('"Питон - отличный язык программирования!", сказал Алексей. ' +
      '"Не припоминаю когда в последний раз мне было настолько весело."')
